fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализаГрафиков/Module.bsl
// @strict-types

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудники = Параметры.ОтпускаСотрудниковОбъект;

	ДиаграммаОтпусов.Очистить();
	
	Для Каждого Стр Из Сотрудники Цикл

		Точка = ДиаграммаОтпусов.УстановитьТочку(Стр.Сотрудник);
		Точка.Текст = Стр.Сотрудник;
		Серия = ДиаграммаОтпусов.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		ЗначениеОтп = ДиаграммаОтпусов.ПолучитьЗначение(Точка, Серия);

		Интервал = ЗначениеОтп.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
	
		СтрокаТаб = Объект.ОтпускаСотрудников.Добавить();
		СтрокаТаб.Сотрудник = Стр.Сотрудник;
		СтрокаТаб.ДатаНачала = Стр.ДатаНачала;
		СтрокаТаб.ДатаОкончания = Стр.ДатаОкончания;

	КонецЦикла;

КонецПроцедуры
